Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If we modify the project to remove all the Kogito extensions from the project, change the version of the `quarkus-resteasy-reactive` extension to `2.6.3.Final` and downgrade `quarkus-prettytime` which is not included in the Quarkus platform BOMs to `0.2.0`, `quarkus:update` will report something like:
ja_jp: プロジェクトを変更し、プロジェクトからすべての Kogito エクステンションを削除する場合は、 `quarkus-resteasy-reactive` エクステンションのバージョンを `2.6.3.Final` に変更し、Quarkus プラットフォームの BOM に含まれていない `quarkus-prettytime` を `0.2.0` にダウングレードします。 `quarkus:update` は以下のように報告します。

source: If we query for a depth of 3, we'll find that the reflection access is an entry point. So, we've found the shortest path to the `persist` method, but that's not necessarily the only path:
ja_jp: 深度3で照会すると、リフレクションアクセスがエントリーポイントであることがわかります。というわけで、 `persist` メソッドへの最短経路を見つけましたが、必ずしもそれだけではありません。

source: If we take a look at `/tmp/code-with-quarkus/target/quarkus-app`, among the other files, we see `app-cds.jsa`, which is the generated AppCDS archive.
ja_jp: `/tmp/code-with-quarkus/target/quarkus-app` を見てみると、他も多数ファイルがありますが、生成された AppCDS アーカイブである `app-cds.jsa` があります。

source: If we take the retry example that we already saw:
ja_jp: 先ほどのリトライの例で言えば :

source: If we then apply this annotation to a test class it will act as if we had applied both the `@QuarkusTest` and `@Transactional` annotations, e.g.:
ja_jp: このアノテーションをテストクラスに適用すると、 `@QuarkusTest` と `@Transactional` の両方のアノテーションを適用したかのように動作します。

source: If we try to get more info about the backtrace that led to this crash we will see that there is not enough information available.
ja_jp: このクラッシュの原因となったバックトレースの情報を得ようとすると、十分な情報が得られないことがわかります。

source: If we update the resource method to:
ja_jp: リソースメソッドを次のように更新します。

source: If we want to actually perform business logic on startup (or write applications that complete a task and then exit) we need to supply a `io.quarkus.runtime.QuarkusApplication` class to the run method. After Quarkus has been started the `run` method of the application will be invoked. When this method returns the Quarkus application will exit.
ja_jp: 起動時に実際にビジネスロジックを実行したい場合(またはタスクを完了してから終了するアプリケーションを書きたい場合)、runメソッドに `io.quarkus.runtime.QuarkusApplication` クラスを指定する必要があります。Quarkusが起動すると、アプリケーションの `run` メソッドが呼び出されます。このメソッドが返されると、Quarkusアプリケーションは終了します。

source: If we want to use a Java main to run the application main it would look like:
ja_jp: Java mainでアプリケーション mainを実行したい場合は以下のようになります:

source: If we were to use the code above, we would get an exception like the following when using the native executable:
ja_jp: 上記のコードを使用した場合、ネイティブ実行可能ファイルを使用すると以下のような例外が発生します:

source: If xref:datasource.adoc#other-databases[your database does not have a corresponding Quarkus extension], or if the defaults do not match your needs for some reason, you will need to set the link:{hibernate-orm-docs-url}#database-dialect[Hibernate ORM dialect] explicitly:
ja_jp: xref:datasource.adoc#other-databases[データベースに対応する Quarkus エクステンションがない] 場合、 または何らかの理由でデフォルト設定がニーズに合わない場合は、 link:{hibernate-orm-docs-url}#database-dialect[Hibernate ORM のダイアレクト] を明示的に設定する必要があります。

source: If you access `http://localhost:8080/q/health` you will get back both checks.
ja_jp: `http://localhost:8080/q/health` にアクセスすると、両方のチェックが戻ってきます。

source: If you add both Hibernate ORM and Hibernate Reactive extensions to your Quarkus app, they can be mixed together in the same project.
ja_jp: Quarkus アプリケーションに Hibernate ORM と Hibernate Reactive の両方のエクステンションを追加すると、同じプロジェクト内で混在させることができます。

source: If you add dependencies while editing, you can get JBang to automatically refresh the IDE project using `jbang edit --live=<idecommand> quarkusapp.java`.
ja_jp: 編集中に依存関係を追加した場合は、 `jbang edit --live=<idecommand> quarkusapp.java` を使用することで、IDE プロジェクトを自動的に更新するように jbang を設定することができます。

source: If you add the `%prod.` profile prefix, data source properties are not visible to `Dev Services for PostgreSQL` and are only observed by an application running in production mode.
ja_jp: プロファイルの接頭辞に `%prod.` を付けると、データソースのプロパティは `Dev Services for PostgreSQL` からは見えなくなり、本番モードで動作するアプリケーションからのみ表示されるようになります。

source: If you add the `quarkus-quartz` dependency to your project the lightweight scheduler implementation from the `quarkus-scheduler` extension is automatically disabled.
ja_jp: プロジェクトに `quarkus-quartz` 依存関係を追加すると、 `quarkus-scheduler` エクステンションからの軽量スケジューラーの実装は自動的に無効になります。

source: If you add these properties in the command line, ensure `"` is escaped. For example, `-Dquarkus.log.category.\"io.quarkus\".level=DEBUG`.
ja_jp: コマンドラインでこれらのプロパティを追加する場合、忘れずに `"` をエスケープして下さい。 例えば、 `-Dquarkus.log.category.\"io.quarkus\".level=DEBUG` .

source: If you add these properties on the command line, ensure the `"` character is escaped properly:
ja_jp: コマンドラインでこれらのプロパティを追加する場合は、 `"` 文字が適切にエスケープされていることを確認してください：

source: If you added Build time data, for example:
ja_jp: ビルド時データを追加した場合の例:

source: If you added a JsonRPC Service with runtime data responses, for example:
ja_jp: 実行時データレスポンスが含まれる JsonRPC サービスを追加した場合の例:

source: If you already have a 32 character long client secret then `quarkus.oidc.authentication.pkce-secret` does not have to be set unless you prefer to use a different secret key.
ja_jp: 32 文字長のクライアントシークレットを既に持っている場合、別のシークレットキーを使用しない限り、 `quarkus.oidc.authentication.pkce-secret` は設定する必要がありません。

source: If you already have a 32 characters long client secret then `quarkus.oidc.authentication.pkce-secret` does not have to be set unless you prefer to use a different secret key.
ja_jp: 32文字長のクライアントシークレットをすでにお持ちの場合は、別のシークレットキーを使用する場合を除き、 `quarkus.oidc.authentication.pkce-secret` を設定する必要はありません。

source: If you already have a 32-character client secret, you do not need to set the `quarkus.oidc.authentication.pkce-secret` property unless you prefer to use a different secret key. This secret will be auto-generated if it is not configured and if the fallback to the client secret is not possible in cases where the client secret is less than 16 characters long.
ja_jp: すでに 32 文字のクライアントシークレットがある場合は、別のシークレットキーを使用する場合を除き、 `quarkus.oidc.authentication.pkce-secret` プロパティーを設定する必要はありません。 このシークレットは、設定されていない場合、およびクライアントシークレットの長さが 16 文字未満でクライアントシークレットへのフォールバックが不可能な場合に、自動生成されます。

source: If you already have an existing Quarkus project, you can add the `oidc` and `keycloak-authorization` extensions by running the following command in your project's base directory:
ja_jp: 既存の Quarkus プロジェクトがある場合は、プロジェクトのベースディレクトリーで次のコマンドを実行して、 `oidc` および `keycloak-authorization` エクステンションを追加できます。

source: If you already have the required `quarkus-oidc` properties configured, associate `quarkus.oidc.auth-server-url` with the `prod` profile. This ensures that `Dev Services for Keycloak` starts the container as expected.
ja_jp: 必要な `quarkus-oidc` プロパティーがすでに設定されている場合は、 `quarkus.oidc.auth-server-url` を `prod` プロファイルに関連付けます。 これにより、`Dev Services for Keycloak` が期待どおりにコンテナーを起動できるようになります。

source: If you already have the required `quarkus-oidc` properties configured, associate `quarkus.oidc.auth-server-url` with the `prod` profile. This ensures that `Dev Services for Keycloak` starts the container as expected. For example:
ja_jp: 必要な `quarkus-oidc` プロパティーがすでに設定されている場合は、 `quarkus.oidc.auth-server-url` を `prod` プロファイルに関連付けます。 これにより、 `Dev Services for Keycloak` が期待どおりにコンテナーを起動できるようになります。 以下はその例です。

source: If you already have your Quarkus project configured, add the `oidc` extension to your project by running the following command in your project base directory:
ja_jp: Quarkus プロジェクトがすでに設定されている場合は、プロジェクトベースディレクトリーで次のコマンドを実行して、`oidc` エクステンションをプロジェクトに追加します。

source: If you already have your Quarkus project configured, you can add the JFR extension to your project by running the following command in your project base directory:
ja_jp: Quarkus プロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行して、 プロジェクトにJFR エクステンションを追加できます。

source: If you already have your Quarkus project configured, you can add the `cache` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `cache` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `csrf-reactive` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトをすでに設定している場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `csrf-reactive` エクステンションをプロジェクトに追加できます:

source: If you already have your Quarkus project configured, you can add the `elytron-security-jdbc` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `elytron-security-jdbc` エクステンションを追加することができます:

source: If you already have your Quarkus project configured, you can add the `elytron-security-ldap` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `elytron-security-ldap` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `hibernate-search-orm-elasticsearch` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `hibernate-search-orm-elasticsearch` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `hibernate-search-standalone-elasticsearch` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、 プロジェクトに `hibernate-search-standalone-elasticsearch` エクステンションを追加できます。

source: If you already have your Quarkus project configured, you can add the `hibernate-validator` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `hibernate-validator` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `infinispan-client` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `infinispan-client` エクステンションをプロジェクトに追加できます:

source: If you already have your Quarkus project configured, you can add the `kafka-streams` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `kafka-streams` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `keycloak-admin-client-reactive` and `resteasy-reactive-jackson` extensions to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトをすでに設定している場合、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `keycloak-admin-client-reactive` と `resteasy-reactive-jackson` のエクステンションをプロジェクトに追加することができます:

source: If you already have your Quarkus project configured, you can add the `keycloak-admin-rest-client` and `rest-jackson` extensions to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `keycloak-admin-rest-client` と `rest-jackson` のエクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `kogito-quarkus-decisions` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `kogito-quarkus-decisions` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `kogito-quarkus-rules` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `kogito-quarkus-rules` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `kogito` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `kogito` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `logging-gelf` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `logging-gelf` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `mailer` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `mailer` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `messaging-kafka` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `messaging-kafka` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `messaging-rabbitmq` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `messaging-rabbitmq` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `micrometer-registry-prometheus` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `micrometer-registry-prometheus` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `mongodb-client` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `mongodb-client` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `oidc` and `keycloak-authorization` extensions to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで次のコマンドを実行することで、 `oidc` と `keycloak-authorization` のエクステンションをプロジェクトに追加できます。

source: If you already have your Quarkus project configured, you can add the `oidc` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `oidc` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `quarkus-micrometer-opentelemetry` extension to your project by running the following command in your project base directory:
ja_jp: Quarkus プロジェクトがすでに設定されている場合、プロジェクトのベースディレクトリーで次のコマンドを実行することで、 `quarkus-micrometer-opentelemetry` エクステンションをプロジェクトに追加できます。

source: If you already have your Quarkus project configured, you can add the `quarkus-opentelemetry-exporter-otlp` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `quarkus-opentelemetry-exporter-otlp` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `quarkus-opentelemetry` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `quarkus-opentelemetry` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `quartz` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `quartz` エクステンションを追加することができます:

source: If you already have your Quarkus project configured, you can add the `redis-client` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `redis-client` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `rest-client-jackson` extension to your project by running the following command in your project base directory:
ja_jp: Quarkus プロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリーで次のコマンドを実行することで、 `rest-client-jackson` エクステンションをプロジェクトに追加できます。

source: If you already have your Quarkus project configured, you can add the `rest-client-reactive-jackson` extension to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `rest-client-reactive-jackson` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `rest-client` and the `rest-client-jackson` extensions to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、 `rest-client` と `rest-client-jackson` のエクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `rest-csrf` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `rest-csrf` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `resteasy-client` and the `resteasy-client-jackson` extensions to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `resteasy-client` 、 `resteasy-client-jackson` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `resteasy-multipart` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `resteasy-multipart` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `scheduler` extension to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `scheduler` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `security-jpa` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `security-jpa` エクステンションを追加することができます:

source: If you already have your Quarkus project configured, you can add the `security-webauthn` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトをすでに設定している場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `security-webauthn` エクステンションをプロジェクトに追加できます。

source: If you already have your Quarkus project configured, you can add the `smallrye-fault-tolerance` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `smallrye-fault-tolerance` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-graphql-client` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `smallrye-graphql-client` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-graphql` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `smallrye-graphql` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-health` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `smallrye-health` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-jwt` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `smallrye-jwt` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-metrics` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `smallrye-metrics` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-opentracing` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `smallrye-opentracing` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-reactive-messaging-kafka` extension to your project by running the following command in your project base directory:
ja_jp: すでに Quarkus プロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行して、プロジェクトに `smallrye-reactive-messaging-kafka` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `smallrye-reactive-messaging-rabbitmq` extension to your project by running the following command in your project base directory:
ja_jp: Quarkusプロジェクトがすでに設定されている場合は、プロジェクトのベースディレクトリで次のコマンドを実行することで、 `smallrye-reactive-messaging-rabbitmq` エクステンションをプロジェクトに追加できます：

source: If you already have your Quarkus project configured, you can add the `spring-boot-properties` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-boot-properties` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-cache` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `spring-cache` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-cloud-config-client` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-cloud-config-client` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-data-jpa` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリーで以下のコマンドを実行することで、プロジェクトに `sspring-data-jpa` エクステンションを追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-data-rest` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-data-rest` エクステンションをプロジェクトに追加することができます。

source: If you already have your Quarkus project configured, you can add the `spring-di` extension to your project by running the following command in your project base directory:
ja_jp: すでにQuarkusプロジェクトが設定されている場合は、プロジェクトのベースディレクトリで以下のコマンドを実行することで、 `spring-di` エクステンションをプロジェクトに追加することができます。
